Autodesk.Revit.DB.HostObjAttributes.SetCompoundStructure(Autodesk.Revit.DB.CompoundStructure)
Sets the compound structure of the element.

Autodesk.Revit.DB.HostObjAttributes.GetCompoundStructure
Returns an object that represents the compound structure of the element.
Remarks: A copy of the compound structure is returned and changes made to it will not apply to the type until SetCompoundStructure is called.
From this object the layers of a compound structure can be accessed. If the element does
not have a compound structure then this method will return null.

Autodesk.Revit.DB.HostObjAttributes
An object that represents characteristics of several kinds of type.
Remarks: This object provides access to structural layering components for any object
derived from it, such as wall types and floor types.